/*
DOM - Document Object Model . Дом Дърво. Това е целия HTML на дадена страница.
BOM - Browser Object Model. Това е самият браузър. В него има Window. което е прозореца на браузъра. В Window имаме document който е ДОМ
също така има navigator , location, history и др.

.textContent - взема/добавя текста между отварящия и затварящия таг. Точно както се визуализира в браузъра
.InnerHTML - освен самия текст взема/добавя и таговете
.value - това е за инпут полета. взема/добавя тяхната стойност.

Вземане на стойности / съдържание от документа (html-a)
- document.getElementById('element id') - взема по ID. Връща целия елемент заедно с атрибутите съдържанието/стойностите. Всичко...
            - можем да му вземем и нещо определно или да променим атрибут.
                - .textContent - ще върне текста вътре в тага
                - Или можем да променим атрибутите => .style.display = "inline";

- document.getElementsByTagName('p') - Взема всички тагове "P" . Връща колекция.
    - Връща нещо като масив и се държи като масив. Можем да го форийчнем

- Подобни са ByClassName , Name.

- Друг начин за вземане е document.querySelectorAll("#id child...") - Взема всички елементи. Връща NodeList - който прилича на масив/обект


 */

